Revit 2027 API
GradientBackgroundSettings.SkyColor Property
 The color of the top of the sky.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color SkyColor { get; set; }
Public Property SkyColor As Color
	Get
	Set
public:
property Color^ SkyColor {
	Color^ get ();
	void set (Color^ value);
}
member SkyColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
GradientBackgroundSettings Class
Autodesk.Revit.DB Namespace